package th.ac.kku.cis.lab.bmi;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class detail extends AppCompatActivity {
    String bmi;
    TextView bmi_number;
    TextView bmi_de;
    TextView bmi_de_post;
    TextView bmi_ad_post;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_detail);

        bmi = getIntent().getExtras().getString("BMI");

        bmi_de = (TextView) findViewById(R.id.detail_bmi);
        bmi_ad_post = (TextView) findViewById(R.id.advice_bmi_post);
        bmi_de_post = (TextView) findViewById(R.id.detail_bmi_post);
        bmi_number = (TextView) findViewById(R.id.number_bmi );

        bmi_number.setText(bmi);
        double Bmi = Double.valueOf(bmi);
        if(Bmi < 18.50){
            bmi_de.setText("น้ำหนักน้อย/ผอม กว่าเกณฑ์");
            bmi_de_post.setText("น้ำหนัก : \n คุณมีน้ำหนักน้อยหรือผอม โดยทั่วไป ค่าดัชนีมวลกายปกติมีค่าน้อยกว่า 18.50");
            bmi_ad_post.setText("ข้อแนะนำ : \n ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวันหรือเกือบทุกวัน \n" +
                    "ให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น เช่น เดินเร็ว ถีบจักรยาน รำมวยจีน \n" +
                    "ลีลาศจังหวะช้า รวมทั้งงานบ้าน งานสวน เป็นต้น สะสมให้ได้อย่างน้อยวันละ 30 นาที\n" +
                    "อาจไม่จำเป็นต้องออกกำลังกายให้เหนื่อยมากหรือหอบ ที่ง่ายที่สุดคือ การเดิน");
        }
        else if(Bmi >= 18.50 && Bmi < 22.90){
            bmi_de.setText("ปกติ");
            bmi_de_post.setText("น้ำหนัก : \n คุณมี น้ำหนักปกติ (สุขภาพดี)โดยทั่วไป\n" +
                    "ค่าดัชนีมวลกายปกติมีค่าระหว่าง 18.50 - 22.90");
            bmi_ad_post.setText("ข้อแนะนำ :  \n ควรกินอาหารให้หลากหลายครบ 5 หมู่\n" +
                    "ในสัดส่วนที่เหมาะสม กินเท่าที่ร่างกายต้องการ\n" +
                    "วันไหนกินมากเกินไป วันต่อมาก็กินลดลง \n" +
                    "กินอาหารพวกข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่นๆ\n" +
                    "ให้มากขึ้นไม่น้อยกว่าวันละ 6 ทัพพี กินผัก \n" +
                    "รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน \n" +
                    "หรือครึ่งกิโลกรัม เพื่อไม่ให้มีพลังงานส่วนเกิน\n" +
                    "จะทำให้ควบคุมน้ำหนักได้ดีและสมดุล\n ");
        }
        else if(Bmi >= 22.90 && Bmi < 24.90){
            bmi_de.setText("ท้วม/โรคอ้วนระดับ 1");
            bmi_de_post.setText("น้ำหนัก : \n คุณมี น้ำหนักเกิน หรือรูปร่างท้วม โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 23 - 24.90");
            bmi_ad_post.setText("ข้อแนะนำ : \n ควรควบคุมอาหาร โดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหาร\n" +
                    "จากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงาน\n" +
                    "ที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน\n" +
                    "/ เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ \n" +
                    "แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้ง \n" +
                    "รวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผัก \n" +
                    "รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม \n" +
                    "เพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน");
        }
        else if(Bmi >= 24.90 && Bmi < 29.90){
            bmi_de.setText("อ้วน/โรคอ้วนระดับ 2");
            bmi_de_post.setText("น้ำหนัก : \n คุณ อ้วนแล้ว (อ้วนระดับ 2) โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 25 - 29.90");
            bmi_ad_post.setText("ข้อแนะนำ : \n ถ้าคุณสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี\n" +
                    " และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี \n" +
                    "รวมแล้วคุณมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี ออกกำลังกาย\n" +
                    "ประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี คุณจะลดไขมัน\n" +
                    "ลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี \n" +
                    "จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม");
        }
        else if(Bmi > 30){
            bmi_de.setText("อ้วนมาก/โรคอ้วนระดับ 3");
            bmi_de_post.setText("น้ำหนัก : \n คุณ อ้วนมากแล้ว (อ้วนระดับ 3) โดยทั่วไปค่าดัชนีมวลกายปกติมีค่ามากกว่า 30");
            bmi_ad_post.setText("ข้อแนะนำ : \n ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอ\n" +
                    "ทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น \n" +
                    "ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20 - 30 นาที \n" +
                    "เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก \n" +
                    "ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ \n" +
                    "เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้\n" +
                    "จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหว\n" +
                    "ร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี");
        }
    }
}
